; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image2 - mode
	image3 - mode
	infrared5 - mode
	image4 - mode
	image0 - mode
	thermograph1 - mode
	image6 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 image0)
	(supports instrument0 image4)
	(supports instrument0 image6)
	(supports instrument0 thermograph1)
	(supports instrument0 infrared5)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
)
(:goal (and
	(have_image Phenomenon6 image4)
	(have_image Planet7 image0)
	(have_image Planet7 image2)
	(have_image Star8 image2)
	(have_image Star8 infrared5)
	(have_image Planet9 infrared5)
	(have_image Planet10 image3)
))

)

; plan
1. (turn_to satellite0 groundstation3 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 planet7 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet7)
   goals met: 0 of 7
5. (take_image satellite0 planet7 instrument0 image2)
   added: (have_image planet7 image2)
   goals met: 1 of 7
6. (take_image satellite0 planet7 instrument0 image0)
   added: (have_image planet7 image0)
   goals met: 2 of 7
7. (turn_to satellite0 planet10 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet10)
   goals met: 2 of 7
8. (take_image satellite0 planet10 instrument0 image3)
   added: (have_image planet10 image3)
   goals met: 3 of 7
9. (turn_to satellite0 phenomenon6 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon6)
   goals met: 3 of 7
10. (take_image satellite0 phenomenon6 instrument0 image4)
   added: (have_image phenomenon6 image4)
   goals met: 4 of 7
11. (turn_to satellite0 planet9 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet9)
   goals met: 4 of 7
12. (take_image satellite0 planet9 instrument0 infrared5)
   added: (have_image planet9 infrared5)
   goals met: 5 of 7
13. (turn_to satellite0 star8 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star8)
   goals met: 5 of 7
14. (take_image satellite0 star8 instrument0 image2)
   added: (have_image star8 image2)
   goals met: 6 of 7
15. (take_image satellite0 star8 instrument0 infrared5)
   added: (have_image star8 infrared5)
   goals met: 7 of 7
